module @module {
  func.func @main(%arg0: !torch.vtensor<[97,8],f32>) -> !torch.vtensor<[97,10],f32> attributes {torch.assume_strict_symbolic_shapes} {
    %0 = torch.vtensor.literal(dense_resource<torch_tensor_32_8_torch.float32> : tensor<32x8xf32>) : !torch.vtensor<[32,8],f32>
    %1 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %2 = torch.aten.linear %arg0, %0, %1 : !torch.vtensor<[97,8],f32>, !torch.vtensor<[32,8],f32>, !torch.vtensor<[32],f32> -> !torch.vtensor<[97,32],f32>
    %3 = torch.aten.relu %2 : !torch.vtensor<[97,32],f32> -> !torch.vtensor<[97,32],f32>
    %4 = torch.vtensor.literal(dense_resource<torch_tensor_10_32_torch.float32> : tensor<10x32xf32>) : !torch.vtensor<[10,32],f32>
    %5 = torch.vtensor.literal(dense_resource<torch_tensor_10_torch.float32> : tensor<10xf32>) : !torch.vtensor<[10],f32>
    %6 = torch.aten.linear %3, %4, %5 : !torch.vtensor<[97,32],f32>, !torch.vtensor<[10,32],f32>, !torch.vtensor<[10],f32> -> !torch.vtensor<[97,10],f32>
    return %6 : !torch.vtensor<[97,10],f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_32_8_torch.float32: "0x04000000D7C9273EC799713EF9DEAA3DA831753E5C84A03DCC78ADBEA7A06ABE983EAA3E72DFA33E56666FBE456142BE32CDCE3DFEAC8D3E862F713E593388BD63B0F7BD1BAE56BDEDB2CDBD2739853EDC9FD93D7A45AD3ED2E18F3E790DA1BDF3FA2C3E78728A3E03278DBCFD2C743E3506853EB76CABBEAE9D79BEF22AE5BD26992E3DDEED0C3E1F6334BE8D5C16BE1CB9E73D48D11CBD3BBD96BEAED2A93E1EA2FE3DBEC44E3EC6E3793D2FA6973E79F0853E50716EBE1D7D2F3E6AF33FBEBE5566BE4C6057BD5788ACBD1B4EE5BDD9A7AC3E945D07BEBF18443E01EE403E7E88553E99EEA4BEF51108BE1554813E0407743EB22C0CBD41EFD93CA4F2873E0B44C03DB98F43BE997F313EDCE35EBEB54CEEBD434B57BED2527ABEE8F4D63CEFEAA03E6138EEBDACDF8A3DA1BFA8BC2D2F873DC476CB3DF8BA0A3E135649BE9AAA11BDECF39A3EC090AE3DFF34C4BDF2C071BE73FD94BEDBF4533D851DD73DAFF7B4BE49379EBE22097BBDB4F4A83D0CA58D3EFC7082BE84B4413C7903B03E76A9A1BEC45C82BD32047F3E7AF7503E6E7DA13E96E8563EBC5A863CE2A1373E509879BE73F721BEC334A1BD908AAC3E6914733E252B4E3E2F7D0ABD2866503E8D26A8BE80F414BDCFB5F13D513C15BD5E5DA33E969DBB3D9A0DE53DE7D398BE55F26FBE635255BDAC0F233EF4F2ADBDF4E08E3D067AC13DCB36953EED517CBE3AD4253E2BDD833D391F0FBEE53593BD56406E3EC14D21BD5B98D7BD4CB9E1BC09E985BE3E6D80BE3AC68CBCDD037DBE4F8069BED74855BEF2739CBE92A67ABE30C7A33B08A6753EF20E893E79FD94BEDF080DBC19C199BBF2252E3E1D2F913ED09E39BE55D652BE37A24ABE575C3EBDB0686D3E9D9CB73D6077A83EDB6ABABD13677EBE0453AF3E4882853E006BA4BE3C97D23C8299A4BE4E5D3BBE8C21EB3D3AF9AEBD1CE594BE61395E3EC8025BBE14C8723D1E7394BE40778ABEF9EAC7BD50F73D3DE5E0A93EF58B9EBE3D5933BD22DFC2BD4A032FBEC4A26CBE887400BC9EFFE83DF3CDE23CE6763A3E79569A3DDD539E3E79563ABEA4D95EBD327DFE3DEFCC5A3D530159BED3B9613E5C3580BEA055A43D3A3CA93EC4DB8D3CD25F85BE0E2A41BDCF6F03BD02339BBE85E53A3E4417983DF111B13ED920A63ED610A23E8DB036BE57ECE13DF9A9BDBD17192FBD1F4281BDFFED223ECEE193BE73C7823D26AA8D3E949466BE82346FBE6E82173E51C95D3C99BFA53DAD47993E120CDABDCC8AB03E428C25BEAF9E47BE23C96E3E24343D3E3C14B3BE27027B3E387B733EC72B933D0200EA3DD66161BEF67B853E08FEA03EE45EF7BD77D092BE998F763E91AD9A3EF69010BE328287BE7F2F33BE4F5F19BE0845B0BEED7791BE88253B3D7672F0BD6232023EA90982BD5611BBBC26385BBE5CF39DBE595194BE9456ACBE25C8223D",
      torch_tensor_32_torch.float32: "0x04000000CCA0AEBE0A9A613EC218B0BE099440BEFE672CBEBDD676BE1AE6C1BD05C163BE6A49233DD2CA263EE6FA84BE725C82BE919B1BBB7D4AC63BF35BACBDE6C3E63D058281BE2E788C3E83BA56BE940C34BD2DFD373EB607993E6A76BEBD0B071DBEADC9BABD8EB19ABEF64C183EBC7255BEDCC07DBEFC8FBD3DC25241BE6BC26A3E",
      torch_tensor_10_32_torch.float32: "0x040000005CDD373C317077BD852F2FBEA89B303EBEC4A8BD3BA30E3E0F0F103E5610E63AA90BB0BD0BF9013EEE1FA03D0121FEBC390B963D06CA69BD799594BD691E113EE7C513BEF63902BE4C8DAF3DCE90B0BD9AA58EBDF9641D3E1AED243D12E65CBD8EF6813DD00B103EA88E33BE8CDE55BD2A0BF33D3F90D73CDDF980BC25E4A1BD5831E93DF443F33D3880AABD58F94ABDBBB5063D303528BE8F469FBC2AC9C33DE286973DF19D05BEB1D814BEF1922D3D814F20BC6E1A28BD7B199B3D6DD7123E31379DBD4B8D1F3E2C4DBC3D9503523D67641B3E25F22F3EFAC0EB3A0B80263DE9C682BDD2CE80BC9E8564BD447CE33D7048993DC4F92FBE805785BD28410C3ED053C03D0BDDA73C283F02BDFB87133E9D78163CA0B722BE48D0D1BDC664B93DC5B3CA3DD501293CA3FF8CBC9B7C14BE43E887BC7C0403BEA33AE9BCDD731FBE3DAD1C3D91E1393DD2BF0CBDD5040ABED910C6BD96F7A2BD1646D8BD4728713D2CD300BE458FBD3D3D910C3E4B6F2ABEC8F5F53DD36A013DE1C0193E30F4193E5671F2BD2633323EBC9C24BEF65D083ED7BF1F3E7A0465BD317224BEB819003E2665B9BD80E8A9BD45C9C4BD66BE05BE302C083D7B77173D92DB1ABE5558B5BD5D85923B96E31ABDA91AA4BD35421FBDC0E162BC6AE300BE31B766BD79BC553D7438283E2B7144BD618B653D1D594BBCB5A0B8BD6FDA2B3E14B97EBD3E23133E9844AE3D8F618F3C7D1D653DD47F92BD3B4A923DA7D6B5BCE04C4ABDD725CA3D0395803C10FB03BCB23810BD0F2424BEF098B43D7FA30ABE0010C33D4DD1A93DE3F1993BD4BA87BD7E0DFABC059DC4BD225C263E5199C0BD6FEAE6BC172DF23C84C57ABBD526963D30020E3E5F4D05BDBB69F53CCA6877BC983EA13CE0E638BD86F8EABDF6A48A3D2C5DA8BD2C40063EDD04263E313810BE4E8DF53CD94E073E57019F3D2947EE3DB9BA17BD7232D33D7DDFDFBC2AF058BA49FD333E0DE70CBE1FFC1BBE294FFF3D9FCBA5BD45FBF3BD309FD93D6C0B943D24BA1E3E8170303EA2C65ABD4A2A293EBB4E323EFD5CD63DD219223DB9C30BBE3A4E15BE92D5023ED749A83DA17C67BDEE42E43D46A5A23C720CB8BDF0C99FBD541202BEB4E71ABED4A52A3D491401BE0819BA3D9055AA3DF5FB0C3EE7A130BE6CF30EBEFC7F4ABD7C20823DC6469ABD9CA921BD6E66C8BD5E7CB2BDF5B1FB3CE883013E080B12BE80BB153EC632B43DCF1C88BD9C8AC93D822B8DBD99D53CBDC534E7BDAF5C9EBC9C1301BEFAB7E6BD12CD48BC04606FBD7C7964BCCBB90A3EBA57A4BD6126D3BD1D4D29BE575D67BD5B7858BDF862EA3D6EA0063D215335BD8B7907BE9E80D6BDFB0ABE3CE40E193EB0A9CBBD692832BE475FA5BDE9AF0CBDA910983D86E471BC487BBD3D8478ADBD9CEBB7BDE8D1923D221019BEAD91953D7A9EE6BD835818BE89FBC93C3E43B9BDFAFD06BECD9D90BD071B1DBEC55243BD81B9DB3D2919D2BDC9B12ABE65530DBEC23628BEB28B8B3D4D06803D7A8B28BDDC0E6E3DC804963C6C8FD0BC782B1FBE709CAA3C582FF03D23AAF03DB78394BA4F02A0BD84E320BED4755E3DAD2110BE26388B3DF3B62B3DE00FF0BD6938F5BBF05C3ABD54B08A3D8742E03DDAA61C3DFA3FA33D4B859B3B62F1CFBC49AC0DBEE7D6D33D26F50BBE1BD21F3DB06DD53DD8F011BE501BDF3D3907BE3DC734FD3D2443983DE7BD8BBDA418843DADC1A1BDF2A602BC4A13323E1E29A9BCE8A00EBE056D1ABED841263E5ECB9CBDE55C0DBECF43CB3C0D3B2F3DBC4D3A3C5A4AE63D5B321A3E67543FBD",
      torch_tensor_10_torch.float32: "0x040000001D66193E1321323E6D2F12BE381DD3BDC59E043E13FB51BD981DDC3D1870A1BB0164363DA5DA08BE"
    }
  }
#-}
